{
    "name": "Moskov",
    "type": "Marksman",
    "story": "Moskov, shooting to fame during the Dhamu Tournament, was already a battle master in his youth. He inherited the family's occult spear fighting skills and, as the next leader of the clan Wildsand, he was loved and respected by many. Watching the Wildsand clan growing stronger day by day, the khan of Thornwolf, who is the leader of the Hietala Grassland, couldn't sit back any longer. One day when the youngsters of Wildsand went out hunting, the Khan slaughtered the entire Wildsand clan. The whole land was scorched by blazing flames of war. Blood flowed like water, yet a slight warmth remained on the bodies of dead families and friends. Faced with this cruel vision, Moskov could not persuade himself to accept it. But even worse, the khan dispatched a formidable cavalry trying to hunt down Moskov's hunting party which were the only survivors from the massacre. In a panic, some fled while others wanted to surrender. Moskov, for the very first time, lifted his spear and aimed it at his own people. Suffering from this painful experience, Moskov became ruthless with the thought of revenge haunting him constantly. However, the khan was too strong to defeat. In order to obtain more power, Moskov chose to fall into the Abyss of Shadow and serve the Queen of Doom, becoming notorious as 'the Spear of Quiescence' ever since.",
    "status": {
        "durability": "42",
        "offense": "95",
        "ability_effect": "25",
        "difficulty": "72"
    },
    "skills": {
        "passive": {
            "name": "Spear of Quiescence",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7coCAAAKnAABbUZ1v3qs491.png",
            "tips": "On a team clash always keep an eye where enemy heroes will be closer to each other or they align on a perpendicular manner, this will give more advantage for you since you can take hits on them and share the damage."
        },
        "first_skill": {
            "name": "Abyss Walker",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cmiAS1nxAABSLxjq8yw650.png",
            "tips": "when using this on Initiating an attack constalnly use this to reposition yourself, since its very vital for moskov to change his angle for better damage output by taking advantage his passive and on his other abilities, this will give you higher survivability specially on team clash where he needs to be at the back and give him a good space to launch his attacks."
        },
        "second_skill": {
            "name": "Spear of Misery",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cnOAcMoeAABZrtUJArY496.png",
            "tips": "You can also use this skill to push enemy away from to their tower, just use your first skill to teleport at the back on your enemy and then use your second skill to push him away from the tower,  just be aware that this act is very dangerous since you will get closer to the tower."
        },
        "ultimate": {
            "name": "Spear of Destruction",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cnqAQ9sTAABbDXwbJEM626.png",
            "tips": "Keep an eye on the minimap and check if there's a clash just be aware if there is an enemy with a low health you can easily finish him off by using this ability, you can use this by mannual targeting you will see an indicator or marking which you will see it on the minimap this will greatly help you to estimate and use this ability."
        }
    }
}