{
    "name": "Zhask",
    "type": "Mage",
    "story": "A great civilization rose out of the ashes of history, but the aggressive nature of the Kastiyans has persisted to the present. Kastiyans use their time-space warping and psionic mind abilities to vanquish weaker races at pleasure. After countless generations of evolution, the Kastiyans have been able to fully mentally manipulate the insect spirit \"Domorey\", or the \"nightmaric spawn\" as they call her in the Kastiyan language. This immortal spirit is able to appear anywhere, with enough power to break through any known physical or magical barriers. After the Kastiyans brought her back to their home planet, they inscribed her spirit into an almighty staff. This staff is now wielded by the King of the Kastiyans, Zhask, who has already used it to invade numerous worlds. Through invasion, the Kastiyans have been able to enslave the minds of the inhabitants and plunder all their resources. Zhask has left his \"Plane Dominator\" signature on the many worlds that he has scourged. One of the many spirits he sent to scout for ripe worlds was entrapped by the Saintly Angel Argus, however, after Argus was cast down the spirit escaped and re-established the link with the motherbrood. This in turn made Zhask aware of the Land of Dawn. Seeing the vast resources that are ripe for the plunder, Zhask has landed upon the fabled land to do what he does best: Dominate, Kill and Reap.",
    "status": {
        "durability": "92",
        "offense": "43",
        "ability_effect": "50",
        "difficulty": "38"
    },
    "skills": {
        "passive": {
            "name": "Dominator's Descent",
            "icon": "https://img.mobilelegends.com/group1/M00/00/00/Cq2IxlplgJuAN52tAABYxH5D5zE7110799",
            "tips": "Using this ultimate in critical moments will allow your Spawn to deal legendary amounts of damage, as no hero can match the power of a full form Nightmaric Spawn. However, the crack in the planescape can only be sustained for 10 seconds, so use your time wisely."
        },
        "first_skill": {
            "name": "Nightmaric Spawn",
            "icon": "https://img.mobilelegends.com/group1/M00/00/00/Cq2IxlplgG6Aai3JAABSLeTakrY4135795",
            "tips": "Every 2 basic attacks of the Spawn will fire a death ray at the enemy. If the death ray strikes the target 7 times consecutively, then it will cause a stun effect. This is definitely Zhask's core skill, we recommend that you keep your Spawn close to you during combat, not only does this little fellow bring damage but he can also provide some extra crowd control. Also, enemies may gain quite a bit of gold slaying the Spawn, as a Planes Dominator you should always look out for the welfare of your minions."
        },
        "second_skill": {
            "name": "Mind Eater",
            "icon": "https://img.mobilelegends.com/group1/M00/00/00/Cq2IxlplgIaAKiFIAABIKUN1vBc8947167",
            "tips": "As the damage does not diminish upon impact, use this ability in conjunction with a well position Nightmaric Spawn to really leave a mark on your enemies!"
        },
        "ultimate": {
            "name": "Hive Clones",
            "icon": "https://img.mobilelegends.com/group1/M00/00/00/Cq2IxlplgJGAJa3dAABPCu2-_Js0753225",
            "tips": "This is a very tactical skill, use it during laning to whoever is attacking your Nightmaric Spawn, not only providing large amounts of damage but also at the same time protecting your Spawn. Placing traps in certain areas of the map will also cause some mental pressure for the enemy team."
        }
    }
}