{
    "name": "Vexana",
    "type": "Mage",
    "story": "A long, long time ago, there was a small country with a kind and caring king and queen, held in high esteem by their subjects. Under the protection of the King of Light, they lived a peaceful life. But deep underground, the Dark Lord of the Abyss was plotting to invade their land. The Dark Lord sent the enchanting vampire queen, Alice, to seduce the king. The king stopped attending court and no longer cared for his once beloved queen or kingdom. The king's betrayal razed the queen's sanity in flames of jealousy, and in an attempt to win back her husband's heart, she made a deal with the Dark Lord to regain her youth and beauty. Every day in the kingdom, another young and beautiful maiden went missing, and a panic fell over the people. The country grew weaker with each passing day, and the sacrifices demanded by the queen's sorcery grew as well. Finally, the kingdom collapsed, with no more sacrifices to be found, and the devouring power of darkness suddenly caused the queen to become a wizened and frightening monstrosity. A thousand years have passed, and this unknown kingdom has since disappeared in the winding river of history, leaving only the legend of the demon queen. Very few today connect this tale with the great and terrible Necromancer Vexana in the Land of Dawn. After all, it happened so very long ago.",
    "status": {
        "durability": "94",
        "offense": "54",
        "ability_effect": "40",
        "difficulty": "66"
    },
    "skills": {
        "passive": {
            "name": "Necromancy Spell",
            "icon": "https://img.mobilelegends.com/group1/M00/00/04/rB_-LVo7dw-ADdjSAABEHeSwxks626.png",
            "desc": "",
            "tips": "This passive is very useful when clearing out minion wave as well as harrassing an enemy in lane. This passive will be used effectively when you use <br>\"Nether Snare\" in the middle of the minion wave. This will apply the passive on each minion and will eventually explode when the minion dies. The explosion covers a certain area that can damage the enemy health bar. "
        },
        "first_skill": {
            "name": "Charmed Specter",
            "icon": "https://img.mobilelegends.com/group1/M00/00/04/rB_-LVo7du6Acyg1AABGuB5lFq4439.png",
            "desc": "",
            "tips": "As much as possible, use this skill on enemy heroes only because you never know when will they attack you. This is also useful when an enemy hero is catching you, just use this skill and their movement speed will get very slow for a period of time making you and opportunity to ran away from them."
        },
        "second_skill": {
            "name": "Nether Snare",
            "icon": "https://img.mobilelegends.com/group1/M00/00/04/rB_-LVo7dvmAes3PAABD52PO0W4063.png",
            "desc": "Vexana summons an curse power to deal 500/570/640/710/780/850 Magic Damage to a specified location.",
            "tips": "This skill damages alot when placed and positioned carefully to hit an enemy hero. This skill very useful on clearing out minion wave. Just place this skill on the second minion (there are 3 minions in each wave right, place it on the middle.) In this way, this skill will hit all of the minions and will activate your passive. This skill deals a huge amount of magic damage. And is perfect for stealing lord, turtle, and jungle monsters when you placed and timed carefully. This skill can possibly one shot all of your enemies when you use it correctly, depending on the build of course."
        },
        "ultimate": {
            "name": "Cursed Oath",
            "icon": "https://img.mobilelegends.com/group1/M00/00/04/rB_-LVo7dwiAWENvAABQw8XwGkY896.png",
            "desc": "",
            "tips": "1st situation: When battling in a 1vs2 situation, use this skill on the damage dealer. (The one who deals a huge amount of damage) Damage dealers can be mages, assassins, and marksman. You have to put your skills prior to the damage dealer so that when they die, they can help you deal damage on the enemy hero.<br>2nd situation: In a 5v5 clash, I recommend to use this skill on tanks. Why? This decreases the regen of their health bar because this skill does magic damage over a period of time. Your 1st and 2nd skill can deal huge damage on other enemy heroes thats why I suggest to use this on tanks. Specially when your team does not have a tank, or your tank is not tanky. But, you can use this on damage dealers to so that you will do more damage. When used in tanks, this will benefit your team because you will have another tank."
        }
    }
}