{
    "name": "Granger",
    "type": "Marksman",
    "story": "There was once a tale going around the Land of Dawn about a musician. No one knew where he came from nor where he was headed. Everyone just called him “the vagrant poet, Granger”. Granger was orphaned during the war between the Moniyan Empire and the Southern Mountains. He was picked up by the Imperial Army, then sent to the Monastery of Light. Similar to all orphans, Granger was silent and isolated. He never showed many feelings through his cold eyes. Only when the melody of violins emerged in the monastery would Granger show any interest in anything, getting lost until the music ended. Every orphan in the monastery had two options for their future as adults: to be a demon hunter, living by completing the secret tasks assigned by the Empire, or to be a servant of the monastery, doing the cleaning and washing for a lifetime. To everyone’s surprise, Granger chose guns and violins at the same time, meaning that he would choose both options. More precisely, he would choose neither of them. He abhorred war and demons, to which he lost his family and home, thus he wouldn’t hesitate to be a hunter. Violins, however, meant a lot to him as they soothed his misery and nightmares. Granger enjoyed music. He would turn a beautiful piece of music to a prelude of battle. In his own words, \"It excites me.\" Since he received his violin, Granger played lousy music wherever he went. The noise from the violins would be so bad that his opponents would lose focus. Granger would take this opportunity to shoot his enemies with his gun before they could realize it’s a trap. Soon after, he took the lead among the demon hunters. Even the S-Level Tasks were not a big deal to him. Impressed by his efficiency and abilities, Alucard, one of the most well-known demon hunters, admired and respected Granger. The news about Granger soon spread among the demons. As soon as anyone heard a horribly sad melody, they would escape with haste - otherwise, it would not end up well for them. After all, a painful death awaits...",
    "status": {
        "durability": "55",
        "offense": "80",
        "ability_effect": "35",
        "difficulty": "69"
    },
    "skills": {
        "passive": {
            "name": "Caprice",
            "icon": "https://img.mobilelegends.com/group1/M00/00/85/Cq2Ixly-xDyAOB5NAABS776mbTs320.png",
            "desc": "Granger can fill his gun with up to 6 bullets at a time. Each 6th bullet deals Critical Damage. ####Granger's Basic Attack will deal more damage, but he gains 50% Attack Speed from Equipment or Emblems.",
            "tips": "Rhapsody is Granger's primary damaging dealing skill. The last bullet of this skill guarantees critical damage. So watch your aim to make sure the last bullet hits the target."
        },
        "first_skill": {
            "name": "Rhapsody",
            "icon": "https://img.mobilelegends.com/group1/M00/00/85/Cq2Ixly-xBmAJozoAABQ_LZUeO0191.png",
            "desc": "Granger fills his gun with all bullets and shoots them forward. Each bullet deals 15/43/71/99/127/155 points of Physical Damage to enemies.",
            "tips": "It's a great combo using this skill to change your position in battle and using \"Rhapsody\" to deal high damage. As it highly increases the Hit Rate of \"Rhapsody\" and reduces the CD time of this skill."
        },
        "second_skill": {
            "name": "Rondo",
            "icon": "https://img.mobilelegends.com/group1/M00/00/85/Cq2Ixly-xCSAIT9DAABOOUHb01M709.png",
            "desc": "Granger blinks in the designated direction, and his next 2/2/2/2/2/2 Basic Attacks deal extra 10%/12%/14%/16%/18%/20% of damage in 5/5/5/5/5/5s. ########Each time \"Rhapsody\" hits an enemy hero, the CD of this skill will be reduced by 0.5/0.5/0.5/0.5/0.5/0.5s.",
            "tips": "Regardless of whether you are in pursuit of an enemy or on the run, take good advantage of this skill to reposition in battle."
        },
        "ultimate": {
            "name": "Death Sonata",
            "icon": "https://img.mobilelegends.com/group1/M00/00/85/Cq2Ixly-xDKAJtCZAABS00d0BzM587.png",
            "desc": "Granger transforms his violin into a super cannon and fills it with all bullets. He then shoots 2 Super Bullets forward at a time. The Super Bullet ignores Minions along the way and only hits enemy heroes. Super Bullets will explode upon hitting the first enemy hero, dealing 120/160/200 points of Physical Damage to enemies nearby and slowing them by 80%/80%/80%. Each time Granger shoots a Super Bullet, he can move to another location. When \"Death Sonata\" ends, the CD of this skill will be reduced by 15%/15%/15%s for every 2 remaining Super Bullets.",
            "tips": "The \"lucky\" effect of Granger's 6th bullet is not limited to his basic attacks, but also work with his 1st skill and ultimate! Make sure you hit the enemies with the 6th bullet to deal massive damage no matter what!"
        }
    }
}