{
    "name": "Freya",
    "type": "Fighter",
    "story": "Valkyries were distinguished and revered fighters among the warlike Northern Vale folks. The bravest and strongest female warriors in each tribe would be chosen to join their rank and take up the responsibility of guiding the spirits of fallen heroes into Valhalla and keeping the peace in Northern Vale. Becoming a Valkyrie would bring glory to everyone in the tribe, it was the greatest achievement one could ever dream for. But such a glory came with a price, and Valkyries had to make huge sacrifices for their privilege. “They shall never marry or bear children, they shall dedicate their entire live to the Northern Vale.”At first, such glory and burden did not belong to Freya. As far as Freya could remember, her elder sister Skuld was their tribe’s best hope. She was clever, decisive, brave and resilient. She could already defeat all the other warriors in their tribe when she was only sixteen years old. The high priest of the Martyr Shrine foresaw the future in a prophecy. “A female warrior, daughter of the Northern Vale, will one day lead this land to a new path.” Everyone believed that the kid in the prophecy was Skuld, so she kept training day and night, hoping that one day she could take up the mantle and bring a glorious future to her tribe and the Northern Vale.Unlike her sister Skuld, young Freya lived a carefree life. She was naughty, vigorous and curious. She admired her sister Skuld, believing that she could live happily ever after so long as her brilliant and lovingly sweet sister was with her. But her sister Skuld disagreed. She would always encourage Freya, saying that Freya would one day become the person who could lead their tribe and even all the Northern Vale folks.When Freya was twelve, Skuld passed the high priest’s trial, became an exalted Valkyrie of the Martyr Shrine, and left her homeland. Two years later, Freya sneaked out of the tribe by herself and headed to Martyr Shrine, the place where all Northern Vale folks were forbidden to visit. She missed her sister so much that she was dying to see Skuld.Her destiny was changed entirely that day. Outside of the Martyr Shrine, Freya was peeking at the Valkyries who were holding a transcendence ritual for the spirits of the dead. But inside this empty hall, a strange light caught Freya’s attention. Freya approached, and realized that it was a strange object floating above the altar. Its radiance encircled itself, like a giant light orb. It felt like there was a wonderful dreamland hidden in its light, calling Freya to come. Propelled by this mysterious force, Freya was unknowingly drawn to it, and reached out to touch the light orb floating above the altar.Suddenly, an immense amount of energy raged inside the orb, then broke free from the seal of the altar, rising straight toward the sky. What Freya didn’t know was that this orb, Heart of Aurora, was actually an ancient relic kept and worshiped by the Northern Vale for the past hundreds of years. But it also had another secret identity: it was the legendary Apocalypse Shard.After Freya accidentally touched it, the immense energy once contained within the Heart of Aurora got out of control and started to grow ever stronger. Should it exploded and spread, the entire Northern Vale would be swept away. This anomaly startled the priests and Valkyries outside. Facing this dire situation, the high priest told everyone that they had to jump into the energy field to be able to stop the energy from growing. Just as Freya was shocked and frozen by this terrible scene, a familiar and gentle figure appeared and hugged her from behind. Skuld emerged from the Valkyries, and gave her own sword and shield to Freya. Skuld smiled to her, then dived into the energy field.The lights became blinding, then everything stopped, and peace was restored in the hall of Valhalla. But after this accident, Skuld and the Heart of Aurora gone rogue both went missing, never to be found again. Freya was in deep sorrow, she blamed herself for this tragedy. The old high priest approached and caressed her forehead. He told Freya that Skuld had always had high hopes for her sister, she believed that Freya was the chosen one, she believed that Freya could lead Northern Vale to a different path.Devastated by the sense of guilt, Freya took up her sister's sword and shield along with her faith on her, and walked into the endless dark night. After years of training and extraordinary efforts, Freya finally became a Valkyrie at the age of twenty. She returned to the Martyr Shrine, took up her sister’s mantle, and kept watch for Northern Vale.Times flew by as Freya stood guard in coldness and snow as a Valkyrie. She had been to everywhere in Northern Vale over the years, reconciling conflicts and resolving difficulties for people. She gave everything she had to Northern Vale, like a caring elder sister. As Captain Bane and his Black Shark Pirates rose, the world of Northern Vale shifted. The merciless Captain Bane and his mortal enemy Franco fought each other fiercely along the coast shore, and the newfound traces of the “Heart of Aurora” drew lots of attentions. The news came: the endless conflict between Bane and Franco, the “Heart of Aurora” that sank into the bottom of ocean, the lurking darkness. She remembered the tragedy that happened years ago and deeply missed her sister. Everything was calling Freya, leading her toward the coast shore.There, she would find all the answers she sought, and she would protect her homeland at all cost as a Valkyrie of Northern Vale.",
    "status": {
        "durability": "37",
        "offense": "80",
        "ability_effect": "70",
        "difficulty": "40"
    },
    "skills": {
        "passive": {
            "name": "Spirit Contact",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cOmACKLZAABaH-MG7CE228.png",
            "tips": "The description of the passive speaks for itself. It has no cooldown and and stacks after every 2nd basic attack once the three orbs disappear. It does not deal a lot of damage but it is pretty decent to have before engaging an opponent and it allows you to kill jungle monsters quicker as well when you are farming."
        },
        "first_skill": {
            "name": "Leap of Faith",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cMKAMg1bAABPBdR8T4g709.png",
            "tips": "Only use it when you're sure that you'll land on the enemy as soon as you jump or else you will just be putting yourself in danger if you can't land that crowd control on them the moment you go in.<br>During a team fight, assess the situation of your team and if it looks bad. do not spam this skill if you only want to make damage since that skill is not freya's source of burst damage, save it instead for when you need to jump out and retreat from the battlefield."
        },
        "second_skill": {
            "name": "Spirit Combo",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cNGAO6DGAABb8h4od6w074.png",
            "tips": "Godspeed Strike is Freya's bread and butter. The skill that makes her really strong in team fights and 1v1 because of the crowd control it offers while enhancing her first 3 basic attacks, with a very low cooldown. It used to be op before as it was spammable but after the nerf, the cooldown now starts once you have done your 3rd basic attack. It's not that bad, the crowd control is still good and a strong/well fed freya can finish off the enemy in just one or 2 combo locks without taking much damage for herself. It is best that you activate this skill first before jumping in with Wings of Faith so that you can accurately lock your enemy with the stun.<br>"
        },
        "ultimate": {
            "name": "Valkyrie",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cNiACLOkAABI_lSpRgg578.png",
            "tips": "Valkyrie is Freya's ultimate and it's best used during team fights. It deals a decent amount of AoE damage as well as slowing the enemies down. It also enhances Freya's physical attack, armor and defense which makes her harder to kill during a fight and it also makes her deal more damage towards the opponent. Combine it with skill 2 and Freya can take down any squishy hero, even 2 of them at the same time if they get caught within her 3 sets of skills in less than 5 seconds."
        }
    }
}