{
    "name": "Franco",
    "type": "Tank",
    "story": "Franco's home is in the eternally frozen seas beyond the land of Northern Vale. This continent of ice and snow is where the sea people have made a life for themselves, but the resurrection of Captain Bane has destroyed their formerly peaceful lives. Franco and his comrades have banded together to oppose Bane's rule and bring peace back to the seas.",
    "status": {
        "durability": "50",
        "offense": "60",
        "ability_effect": "80",
        "difficulty": "60"
    },
    "skills": {
        "passive": {
            "name": "Wasteland Force",
            "icon": "https://img.mobilelegends.com/group1/M00/00/02/rB_-LVo6VAWABN_5AABbqkHZHS4571.png",
            "icon_local": "./hero/Franco/img/skills/passive_wasteland_force.png",
            "desc": "",
            "tips": "Wasteland Force adalah Skill pasif yang membuat Franco menjadi Ganker sekaligus Tank yang menakutkan. Pasif ini membuat Anda bertahan lebih lama di Lane dan memudahkan Anda untuk mengambil posisi dengan baik di dalam semak-semak."
        },
        "first_skill": {
            "name": "Iron Hook",
            "icon": "https://img.mobilelegends.com/group1/M00/00/02/rB_-LVo6U9qAQRAjAABYOXOLHLI610.png",
            "icon_local": "./hero/Franco/img/skills/first_skill_iron_hook.png",
            "desc": "",
            "tips": "Skill ini adalah Skill yang paling mengerikan dari Franco. Umumnya bila berhasil menarik lawan ke arah teman satu tim Anda, kemungkinan besar akan membunuh lawan yang tertarik tersebut. Hanya saja Skill ini tidak mudah untuk digunakan."
        },
        "second_skill": {
            "name": "Fury Shock",
            "icon": "https://img.mobilelegends.com/group1/M00/00/02/rB_-LVo6U-aAChlwAABRtkMIBwA324.png",
            "icon_local": "./hero/Franco/img/skills/second_skill_fury_shock.png",
            "desc": "",
            "tips": "Fury Shock adalah Skill AOE yang memiliki efek Slow. Skill ini dapat digunakan untuk membersihkan Lane atau mencegah lawan untuk melarikan diri setelah tertarik oleh Hook Franco."
        },
        "ultimate": {
            "name": "Bloody Hunt",
            "icon": "https://img.mobilelegends.com/group1/M00/00/02/rB_-LVo6U_GAfS3BAABXi6kzYBU515.png",
            "icon_local": "./hero/Franco/img/skills/ultimate_bloody_hunt.png",
            "desc": "",
            "tips": "Brutal Massacre juga merupakan Skill Follow Up yang digunakan setelah berhasil menarik lawan dengan Hook Anda. Skill ini memiliki efek Stun yang dapat mencegah lawan melarikan diri atau memberikan waktu kepada teman satu tim Anda untuk menghabisi lawan yang terkena Stun dari Brutal Massacre."
        }
    }
}