{
    "name": "Vale",
    "type": "Mage",
    "story": "\"Valir, my beloved brother. You lost everything the day we made the pact. I'll see to it that the Fire Kingdom restores everything to the way it once was. If you wish to avenge your cruel father, I do not blame you as long as you can cast away the storm within your heart. Nothing is as important as your happiness, not even my life.\" Vale fell into deep contemplation as he began to write his letter to Valir. Those first few lines brought Vale back to the days of his youth, when he and Valir were the closest of friends. As Vale fell further into nostalgia, he remembered the day they met at a royal party. Ever since then, they both felt a strong affinity towards each other's magic. For a long time, Vale and Valir were inseparable. Together, they left many memories in the Valley of the Winds, the Fire Kingdom, and many other exotic lands. When unrest flooded the Fire Kingdom, Valir quickly made his leave. Only Vale knows exactly how much Valir sacrificed that day. As time went on, the day of the pact was coming soon. Vale's magical abilities used to control the winds have grown more sophisticated over the years. In fact, he's the only member of his family who can change the winds with magic Yet, Vale has never shown his magic to anyone before. Vale waited and waited for the day of the pact to come. On that day, he would put on a spectacular display of wind magic for Valir. Vale believes that Valir will see his magic, remember the precious times they had together, and return to how things were in their youth.",
    "status": {
        "durability": "88",
        "offense": "40",
        "ability_effect": "46",
        "difficulty": "65"
    },
    "skills": {
        "passive": {
            "name": "Windtalk",
            "icon": "https://img.mobilelegends.com/group1/M00/00/74/Cq2IxlxP-HOABuq5AABJ-4aHBq8982.png",
            "desc": "",
            "tips": ""
        },
        "first_skill": {
            "name": "Wind Blade",
            "icon": "https://img.mobilelegends.com/group1/M00/00/74/Cq2IxlxP-ECAB0WUAAA6pBraF7g746.png",
            "desc": "",
            "tips": " It's the main damage-dealing skill of Vale and it takes time to deal the high-burst damage. So it would be better to ensure the hit rate by releasing it in advance or using it when the enemies are under control. If your team provides enough control, then it would be better to choose to increase damage. Otherwise, it would be better to choose to increase area so that the skill hit rate will get improved. When choosing to enhance skills for the first time, if for higher damage, choose to enhance 1st kill first then."
        },
        "second_skill": {
            "name": "Windblow",
            "icon": "https://img.mobilelegends.com/group1/M00/00/74/Cq2IxlxP-E2ARADvAAA5jgeMZmk176.png",
            "desc": "",
            "tips": "The slowing down effect of this skill can increase the hit rate of his 1st skill. Normally it would be better to choose knock up effect. If your team provides enough control, then better choose stop-on-hit effect. For the first time if you don't choose to build damage of 1st kill, then you should choose the knock-up effect of this skill, for it provides stable control for the team. Normally, this skill will be build when it's the third time to enhance skills."
        },
        "ultimate": {
            "name": "Windstorm",
            "icon": "https://img.mobilelegends.com/group1/M00/00/74/Cq2IxlxP-FmAHij0AABC0zMLKAE590.png",
            "desc": "",
            "tips": "Choosing to increase damage is always a good choice, but it needs choosing knock-up effect of 2nd skill, or it is hard to use ultimate to hit enemies. When choosing control effect, the damage of 1st skill should be ensured. Normally, choose to enhance Ultimate for the second time."
        }
    }
}