{
    "name": "Lylia",
    "type": "Mage",
    "story": "At the underground lab of the Magic Academy, warnings and danger signs are everywhere. This is paradise for dark magicians. Sudden explosions and pungent magical potions make the place a horrible \"Haunted House\". Few will come here, and no one is willing to befriend the dark magicians.The once brilliant black magicians are hard to find now. As a descendant of dark magicians, Lylia has a quirky character and unparallel magical creativity. According to historical records of the Magic Academy, Lylia’s parents were the highest authority among the dark magicians and the pioneers in the creation of the Academy. However, due to the destructive power and particularity of black magic, Lylia’s parents were forced to leave the Magic Academy a long time ago. Lylia grew up alone and was often misunderstood because of her identity as a black magician. At too many thrilling moments, people called her \"Little Witch\" in a not-that-friendly way. Lylia really wants to prove herself. She wants friends, and to be recognized, like other magicians. Lylia offered to help her classmates. For example, when Eudora needed lightning magic, she used a black magic lightning rod to help Eudora create a larger lightning strike. But her “help” eventually led to Eudora being wounded. On another occasion, Harley wanted to improve his magic ability, so Lylia practiced black magic on Harley's Magic Hat. Again, Harley was hurt by the black magic. No matter how she tried, it was impossible for her to get rid of the name. The magicians of the Magic Academy regard Lylia as \"trouble.\" Over time, Lylia came to accept such an identity and behaved like a real \"troublemaker\". But her obsession with black magic never changed; she knows that black magic is omnipotent and capable of docking different spaces – connecting the real world to any time in the past or in the future. She wants to become the greatest dark magician, and she wants to meet her parents. This wish drives her to fight on despite repeated setbacks to find the most powerful black magic. Lylia has tried to use dark magic to crack the time gap, hoping to find the \"critical moment\". Unfortunately, each cracking brought meteorites or other creatures from alien worlds. Lylia is not reconciled; she keeps deploying her magical energy, hoping to find the most stable way.  Until recently, when Lylia found a strange creature from the torn cracks with black magic – the Snores, a kind of void monster who enjoyed devouring magic. When Lylia practiced dark magic, Snores almost completely filled the lab. They reproduced themselves at an alarming rate. They were so loyal to Lylia that every instruction of Lylia was responded to in time. For the first time, Lylia felt that she has many lovely friends. But these strange creatures were getting increasingly greedy. Lylia had an idea. She opened the door of the underground lab. Snores swarmed out, looking for all kinds of magical energy. Lylia looked at the \"disaster\" with an imperceptible smile. The \"trick\" indicated that the greatest black magician of the Magic Academy has finally returned. Magicians, are you ready?",
    "status": {
        "durability": "85",
        "offense": "50",
        "ability_effect": "53",
        "difficulty": "60"
    },
    "skills": {
        "passive": {
            "name": "Angry Gloom",
            "icon": "https://img.mobilelegends.com/group1/M00/00/8E/Cq2Ixl039mGAeWCbAABUZIKHAcw933.png",
            "icon_local": "./hero/Lylia/img/skills/passive_angry_gloom.png",
            "desc": "Lylia gets power from Gloom, increasing her Movement SPD by 15%. Each Gloom upgrade further increases this bonus by 5%.####Gloom gains an upgrade every time he devours Shadow Energy, up to 5 times. Gloom upgrade increases the detonation damage of Shadown Energy.",
            "tips": "Lylia gets power from Gloom, increasing her Movement Speed. Each time Gloom levels up, she will increase extra Movement Speed. Gloom will increase his levels by devouring Shadow Energy. Up to 5. The higher his level is, the more damage he can deal."
        },
        "first_skill": {
            "name": "Magic Shockwave",
            "icon": "https://img.mobilelegends.com/group1/M00/00/8E/Cq2Ixl039nSAKQaqAABSamNDLkU283.png",
            "icon_local": "./hero/Lylia/img/skills/first_skill_magic_shockwave.png",
            "desc": "Lylia sends out Gloom with a shockwave, dealing 250/300/350/400/450/500 Magic Damage to enemies in a line and slowing them by 40%/40%/40%/40%/40%/40% for 1.5/1.5/1.5/1.5/1.5/1.5s.####If Gloom touches Shadow Energy, he will devour and detonate it.",
            "tips": "Lylia releases an attack wave ahead, dealing Magic Damage to enemies on the path and slowing them down. Gloom will hitch a ride on Magic Shockwave. If Gloom touches Shadow Energy, he will devour it and immediately detonate the energy."
        },
        "second_skill": {
            "name": "Shadow Energy",
            "icon": "https://img.mobilelegends.com/group1/M00/00/8E/Cq2Ixl039ouAIhycAABT2pC9y6k281.png",
            "icon_local": "./hero/Lylia/img/skills/second_skill_shadow_energy.png",
            "desc": "Lylia condenses Shadow Energy at the target location, dealing 100/110/120/130/140/150/160 Magic Damage to enemies hit and slowing them by 80%/80%/80%/80%/80%/80%/80%.####Shadow Energy can be detonated by Gloom's devour, dealing 250/275/300/325/350/375/400 Magic Damage to the enemies nearby. Each Gloom upgrade increases the detonation damage by 30%/30%/30%/30%/30%/30%/30%, up to 120%/120%/120%/120%/120%/120%/120%.####Lylia starts with the skill Shadow Energy.",
            "tips": "Lylia condenses Shadow Energy to the designated area, dealing Magic Damage to enemies nearby and slowing them down. After Gloom devours Shadow Energy, he will detonate the energy and deal Magic Damage to enemies nearby. Each time Gloom upgrades himself, the damage dealt by Shadow Energy will be increased. Lylia was born to have the ability to use Shadow Energy."
        },
        "ultimate": {
            "name": "Black Shoes",
            "icon": "https://img.mobilelegends.com/group1/M00/00/8E/Cq2Ixl039paAWypFAABVH-YOKiw301.png",
            "icon_local": "./hero/Lylia/img/skills/ultimate_black_shoes.png",
            "desc": "Lylia returns to where the Black Shoes were 4/4/4s ago and restores all Shadow Energy charges, regenerating 10%/15%/20% of her Max HP and increasing her Movement Speed by 20%/20%/20% for 2/3/4s.",
            "tips": "Lylia immediately returns to the position where the Black Shoe was 4s ago and stacks max times to use Shadow Energy, regenerating a certain amount of HP and increasing her Movement Speed."
        }
    }
}