{
    "name": "Hilda",
    "type": "Fighter",
    "story": "On the barren Megalith Wastelands, all one can see are the giant rocks and the sparse bushes, but this desolate land is where Hilda and her people call home. The land's infertile soil required everyone in the clan to become a good hunter in order to acquire precious meat. Born with great strength, Hilda soon became the leader of the hunting party and led her people to harvest great amounts of food. However, an unknown power in their territory drove wild animals into a frenzy and it became more and more difficult to hunt. Eventually, crazy beasts started to attack the clan. As the patriarch's premonition of a crisis started to become a reality, Hilda was forced to search for new habitats. With the hopes and dreams of the tribe on her back, she headed to the Land of Dawn. With her rich hunting experience, she became a mercenary of great reputation and expertise. Her only wish is to find a new home for her people and to fight for their future.",
    "status": {
        "durability": "52",
        "offense": "58",
        "ability_effect": "85",
        "difficulty": "40"
    },
    "skills": {
        "passive": {
            "name": "Blessing of Wilderness",
            "icon": "https://img.mobilelegends.com/group1/M00/00/04/rB_-LVo7dkuAVH_gAABDNoNXZQk268.png",
            "desc": "",
            "tips": "Her passive is a very strong tool for fights, she can always do trade damage in her lane then go to the bush to heal herself. Always maximize the use for this passive because it will help you a lot when laning."
        },
        "first_skill": {
            "name": "Combat Ritual",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7diOAC0XuAABA1DGKFPw834.png",
            "desc": "",
            "tips": "This is a good skill to chase or zone out enemies, especially damage dealers with low mobility (mage, assassin, marksman) especially during team fights. Hilda can target the enemy backline with this skill or chase away assassin who are killing their team’s carry.<br>"
        },
        "second_skill": {
            "name": "Art of Hunting",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7dimACoLFAABLosft1kg688.png",
            "desc": "",
            "tips": "This is your primary source of crowd control. Movement speed is useless if you can’t pin down your target. This makes sure that your target will be chased away or will be zoned out from the team fight making the target useless. Aside from the crowd control, this deals enough amount of damage to make the enemy fall back. Make sure that you are going punish your target with this ability.<br>"
        },
        "ultimate": {
            "name": "Power of Wildness",
            "icon": "https://img.mobilelegends.com/group1/M00/00/04/rB_-LVo7dkSAJcWGAABVf75N_es902.png",
            "desc": "",
            "tips": "Make sure that you get assists as much as possible to have stacks for Hilda’s ultimate. It is very convenient since every stack gives you a lot of additional damage, with this said, Hilda’s not only tanky but can also deal a decent amount of damage to the enemy she’s targeting. This also completes the kit of Hilda in dominating every lane she gank.<br>"
        }
    }
}