{
    "name": "Carmilla",
    "type": "Support",
    "story": "Many years ago, Carmilla was born in the House Ansaac in the Castle Aberleen. As the only daughter of the Earl, she was loved by all her family since birth. When she grew up, her eminent family background coupled with her captivating beauty made her one of the most popular noble ladies around the Castle Aberleen, and maybe even the whole Empire. However, her royal origin was inevitably bound to the tragedy as was to become a political tool of her father Earl Anssac, consolidating power by betrothing her to another family of power.Though countless aristocrats tried to court Carmilla, none of them pleased her. Her innate pride made her refuse to bow down to mediocrity. What she wanted was someone who could connect with her soul. But, her father Earl Ansaac had already made his decision. As the threat of the abyss was getting closer, he knew that the new class of military-nobles would dominate the politics of the land. Thus, he had to establish good relations with them in order to sustain the social status of his family.However, a man who was a rather insignificant to the old Earl foiled this plan. This man was Cecilion, the best opera singer in the southern Empire. Carmilla became his most loyal audience since the first day he came to the Castle Aberleen. In Carmilla’s eyes, he was just so elegant and talented, but she could also read the melancholy and the mystery from his eyes. For every performance of Cecilion, Carmilla would sit in the right middle in the auditorium, quietly enjoying his song performance. One day, as the curtains called, Cecilion and Carmilla's eyes met. The flames of passion ignited between them. And like a bolt of lightning cracking open the dark night sky, they instantly fell in love.The days that followed were the happiest ones in Carmilla's life. When night fell, Cecilion dressed up and came to invite her to the opera house, singing songs he composed for her. And Carmilla watched his performance intently, never taking her eyes off him. When the performance ended, they dated at the backstage, dancing in the moonlight. And in the early morning, Cecilion would put a rose on Carmilla's windowsill that was nourished by the morning dew and leave quietly.As time went by, Carmilla noticed something unusual about Cecilion. He lived in solitude and never had needless contact with others. His skin was always pale, even when he didn’t makeup; and it seemed that he always tried to avoid something. From his eyes, Carmilla could feel his desire for a normal life, and she could vaguely see that Cecilion might have some connection to the legendary blood demon species. Though Cecilion never talked about his origins with her, she still chose to believe in him, because she could feel his love was real. No matter he was man or blood demon, it was just about love between them, and Carmilla believed that she would always belong to Cecilion, and would spend the rest of her life with him.Though they loved each other so deeply, Carmilla’s father the Earl forbade her to marry this humble singer. He imprisoned her and forced her to marry Baron Tawil, the general of the imperial army, who was stationed near the Castle Aberleen. In order to make Carmilla forget Cecilion, the Earl even sent his men to close the opera house. In Cecilion’s mind, he knew that the love between the blood demon and mankind would never be true. Though he loved Carmilla, he finally decided to give up. At the day he left, he wrote a letter to her, in which he told her everything, about his origins, his story, and left it with a rose at her windowsill.Carmilla didn’t stop fighting, she was not willing to succumb to her father's will. But her heart broke when she read his parting letter. To Carmilla, it didn't matter what species he belonged to. She loved him, and without him, her life would become meaningless.She stood at the window, watching the direction Cecilion left to. As the dawn was raising, she slit her wrist with a sharp dagger. The world fell into endless darkness. And Carmilla buried her love in her own way.When Carmilla awoke, she found herself once again in Cecilion’s arms. His eyes were full of kindness, and he was looking at her. Then she found that her touch was so cold, as if she was lifeless, and her skin looked just as pale as Cecilion's. She knew, her lover didn’t abandon her, he returned and revived her with his blood. These two lonely souls finally were together again and could live with each other forever.After that day, the people of Castle Aberleen never saw Cecilion or Carmilla again, only the legendary tales of the night, which passed from mouth to mouth over time. When night came, Carmilla nestled in Cecilion's arms above the top tower of Castle Aberleen, as if time stood still.",
    "status": {
        "durability": "90",
        "offense": "40",
        "ability_effect": "45",
        "difficulty": "55"
    },
    "skills": {
        "passive": {
            "name": "Vampire Pact",
            "icon": "https://img.mobilelegends.com/group1/M00/00/9E/Cq2Ixl4XLMeAXrWwAABQ8-kC_wo354.png",
            "icon_local": "./hero/Carmilla/img/skills/passive_vampire_pact.png",
            "desc": "Carmilla steals 10-20 Physical&Magic Defense (scales with level) from the enemies while dealing damage to them. Each target can be stolen only once in 5s. The stolen Physical&Magic Defense can be stacked up to 5 times. Lasts for 5s.",
            "tips": "This skill increases Carmilla’s defense and grants her an edge when fighting. Combined with the regen effect of Crimson Flower, Carmilla’s durability could be increased."
        },
        "first_skill": {
            "name": "Crimson Flower",
            "icon": "https://img.mobilelegends.com/group1/M00/00/9E/Cq2Ixl4XLKWAJ3FVAABUQFg7CsE045.png",
            "icon_local": "./hero/Carmilla/img/skills/first_skill_crimson_flower.png",
            "desc": "Carmilla increases 25%/25%/25%/25%/25%/25% movement speed, and summons 2 Crimson Flowers circling around herself for 5/5/5/5/5/5s. Enemies hit by the Crimson Flowers will receive 100/130/160/190/220/250 Magic Damage and be slowed down by 30%/30%/30%/30%/30%/30%. Meanwhile, the spinning speed of the Crimson Flowers will be increased for 0.8/0.8/0.8/0.8/0.8/0.8s.####Each time the Crimson Flowers deal damage to enemies, Carmilla will restore 50/65/80/95/110/125 HP. (If the target is a minion, restores 30%/30%/30%/30%/30%/30% of this amount only.)",
            "tips": "This Skill is Carmilla’s core damage dealing skill. Once the Crimson Flowers hit enemies, their circling speed will increase. Therefore, Carmilla could deal more damage and restore her HP more quickly. That increases Carmilla’s durability in Team Fights."
        },
        "second_skill": {
            "name": "Bloodbath",
            "icon": "https://img.mobilelegends.com/group1/M00/00/9E/Cq2Ixl4XLLCARQjgAABXnIGj8WA588.png",
            "icon_local": "./hero/Carmilla/img/skills/second_skill_bloodbath.png",
            "desc": "Carmilla accumulates Bloodbath Energy, greatly increasing her Movement Speed by 60%/60%/60%/60%/60%/60% (decays rapidly in 3.5/3.5/3.5/3.5/3.5/3.5s).########Use Again: Carmilla casts Bloodbath Energy to a designated enemy (can't target at the minion), dealing 150/180/210/240/270/300 Magic Damage and stunning the enemy for 0.6/0.6/0.6/0.6/0.6/0.6s. ####The damage and the stunning duration scale with the Bloodbath Energy accumulation, capped at 100%/100%/100%/100%/100%/100%.",
            "tips": "With Bloodbath, Carmilla could control enemies with relatively high hit rate when roaming and therefore, assist her allies to slay targets."
        },
        "ultimate": {
            "name": "Curse of Blood",
            "icon": "https://img.mobilelegends.com/group1/M00/00/9E/Cq2Ixl4XLLuAO42YAABJelFtADc414.png",
            "icon_local": "./hero/Carmilla/img/skills/ultimate_curse_of_blood.png",
            "desc": "Carmilla casts Curse of Blood in a designated direction. The Curse will spread out from the enemy hit to nearby enemy heroes, dealing 275/400/525 Magic Damage and slowing them down by 90%/90%/90% for 5/5/5s (decays rapidly to 30%/30%/30% in 3/3/3s).########The curse can be inflicted to up to 3/3/3 targets at the same time.####As long as one target with the Curse of Blood is damaged or controlled, the other influenced targets will also receive damage and CC effect (damage decreases to 50%/50%/50%, CC duration decreased to 50%/50%/50%). ",
            "tips": "This Skill is a masterstroke in Team Fight. Carmilla and her allies could deal massive Damage once she chains her targets. It also grants Crowd Control effect to a Control Skill. With this Skill, Carmilla and her allies could be invincible in Team Fight."
        }
    }
}