{
    "name": "Ling",
    "type": "Assassin",
    "story": "At the top of the mountains enshrouded by clouds, lies the entrance to the Hidden Land of the Dragon – the “Sky Arch”. Beside the Sky Arch stood many assassins in black. The cyan embroidery etched on their clothes identified them to being part of the most mysterious assassin faction of the Cadia Riverlands, the “Finch”. Legends say, it’s impossible to escape from claws of the “Finch”.After a while, a man landed beside the Sky Arch. With his lithe footwork, he didn’t create any ripples on the lake of clouds. This man was the Finch’s best assassin known as the “Cyan Finch”. Without hesitation, he swung his Defiant Sword, generating great energy and opening the Sky Arch. The assassins behind him dashed across the arch and entered the Hidden Land of the Dragon. As a perfect assassin, Cyan Finch couldn’t tolerate failure. This time was the same. However, the Hidden Land had many occult traps and enchantments to resist invaders, which made the assassins to lose their wings and fall from the sky. Even so, those traps could not stop Cyan Finch at all. His light feet glided over the perils and past into the Hidden Land.Cyan Finch quickly got to the core of the Hidden Land – the Great Dragon Palace. All the guards were attracted by the turmoil on the Sky Arch, and hence left the Palace undefended. He overlooked this palace from high point, recalling the time when he was called “Ling”, when he was betrayed. At that time, Ling and Zilong dwelled in the Hidden Land, receiving the Great Dragon’s training. To become the successor of the Great Dragon was their common goal. However, though the talent Ling defeated Zilong in the final contest, the Great Dragon still chosen Zilong as his successor and his foster son.Ling left the Hidden Land in disgrace and an unsettled heart. Consumed with hatred and the need for power, he fanatically trained himself. His efforts paid off several years later and he became the best assassin and to be later known as Cyan Finch. His enemies even would tremble at hearing his name. Well-known as he was, he still was not satisfied. He needed something to fulfill the void in his heart. One day, he encountered the Black Dragon, a traitor who was banished from the Hidden Land. He proposed a scheme to take revenge on the Hidden Land and Cyan Finch accepted the offer as they both had faced a similar deceit.Ling looked at the Great Dragon sitting in the Palace ominously, and in an instant, he appeared in the center of the Palace. The Great Dragon stared at his once apprentice, shaking his head and sighing. Ling didn’t do anything as he was waiting for his true opponent to come. With a silver flicker, Zilong appeared in the way between Ling and the Great Dragon with his Dragon Spear in hand. This was the moment Ling, now as the Cyan Finch, was waiting for – the moment to settle the score and to prove the Great Dragon wrong. The time the Defiant Sword and the Dragon Spear clashed and a great wave of energy filled the Palace. They fought for hundreds of rounds, from inside to outside. However, they couldn’t best each other.Ling found that Zilong was not the weak foe he once defeated. Frustrated with this, Ling mustered all his power to cast his deadliest skill - “Tempest of Blades”. Its great energy shook the entire Hidden Land. Zilong held his ground in the center of the Sword Field without fear. Zilong wielded his Dragon Spear and pursued Ling’s sword like an unyielding dragon. Zilong, powerful as he was, was no match for Ling’s speed and finesse as he found his adversary’s sword pointing at his eye. However, Ling’s hand trembled and hesitated on seeing that Zilong withdrew his spear before it was about to hit him.The memory of training together and encouraging each other filled Ling’s heart. Also, Zilong trusted that their friendship could overcome their conflict. All this made Ling withdraw his sword. He realized that what made him confuse was not the choice made by the Great Dragon, but rather it was the reason why Zilong allowed himself to be defeated. Zilong chose to trust the one who had missing for years and dropped his guard. Just like that decisive battle, Zilong chose to be defeated by him in order to help Ling achieve his dream. Ling knew in his heart that this was the last chance to fight fairly with Zilong.Zilong knew that Ling’s confusion had been resolved and Ling could now fly through the sky like a real Cyan Finch. However, Zilong also knew that Ling’s raid indicated the coming of the true crisis - The Black Dragon was coming.",
    "status": {
        "durability": "60",
        "offense": "80",
        "ability_effect": "55",
        "difficulty": "87"
    },
    "skills": {
        "passive": {
            "name": "Cloud Walker",
            "icon": "https://img.mobilelegends.com/group1/M00/00/99/Cq2Ixl3CM7OAYy8CAABMs77yPtk701.png",
            "icon_local": "./hero/Ling/img/skills/passive_cloud_walker.png",
            "desc": "Ling's superb lightness skill helps him leap among walls. When resting on the wall, Ling restores extra 2 Lightness Points per second. Every time Ling deals damage to enemies, he restores extra 5 Lightness Points.########Ling’s lightness skill grants him 30% Crit Chance, but decreases his Crit Damage by 60%.",
            "tips": "Ling's superb lightness skill helps him leap from wall to wall to chase enemies. When resting on the wall, Ling restores extra Lightness Points per second. Every time Ling deals damage to enemies, he restores extra Lightness Points. Ling’s lightness skill grants him Crit Chance, but decreases his Crit Damage.<br><br>The Crit Chance of Ling’s Passive Skill grants him the possibility of dealing Burst DMG in Early Game. With proper equipment and emblems, the Crit Chance could greatly increase the burst DMG he deals."
        },
        "first_skill": {
            "name": "Finch Poise",
            "icon": "https://img.mobilelegends.com/group1/M00/00/99/Cq2Ixl3CM8eAZBPMAABnSsnPcTg897.png",
            "icon_local": "./hero/Ling/img/skills/first_skill_finch_poise.png",
            "desc": "Passive: Permanently increases the Crit Chance by 5%/0.075/10%/0.125/15%/0.175.########Active: Ling casts his Qinggong(lightness skill), leaping to the designated wall, entering camouflage state and restoring Lightness Points more quickly. When Ling receives damage, he will end the camouflaged state. If he is controlled, he will fall onto the ground. When using this skill to jump from a wall to another, it will reset the CD and refresh the Camouflage State.",
            "tips": "Passive: Ling permanently increases the Crit Chance. His Crit Chance will be improved after 1st Skill levels up.<br> <br>Active: Ling casts his Qinggong (lightness skill), leaping to the designated wall, entering camouflage state and restoring Lightness Points more quickly. When Ling receives damage, he will end the camouflaged state. If he is controlled, he will fall onto the ground. When using this skill to jump from a wall to another, it will reset the CD and refresh the Camouflage State.<br><br>Ling could quickly leap from wall to wall and could move to anywhere at the battlefield. He could escape from the danger quickly."
        },
        "second_skill": {
            "name": "Defiant Sword",
            "icon": "https://img.mobilelegends.com/group1/M00/00/99/Cq2Ixl3CM9SATfckAABYuDBMDDo185.png",
            "icon_local": "./hero/Ling/img/skills/second_skill_defiant_sword.png",
            "desc": "Ling charges in a designated direction and stabs the nearby enemies at his destination, dealing 165/185/205/225/245/265 Damage. ########If Ling casts this skill when he is on the wall, he will dash to a designated spot on the ground, dealing 165/185/205/225/245/265 Damage to enemies within a small area and slowing them down by 30%/30%/30%/30%/30%/30% for 1.5/1.5/1.5/1.5/1.5/1.5s. If this attack deals crit damage, enemies within the area will extra be slowed by 45%/45%/45%/45%/45%/45% for 0.75/0.75/0.75/0.75/0.75/0.75s.########\"Defiant Sword\" can trigger ATK Effects as Basic Attack and can restore 35/40/45/50/55/60 HP for Ling each time hits an enemy.",
            "tips": "Ling charges in a designated direction and stabs the nearby enemies at his destination. If Ling casts this skill when he is on the wall, he will dash to a designated spot on the ground, dealing Damage to enemies within a small area and slowing them down. If this attack deals Crit damage, enemies within the area will extra be slowed.<br><br>\"Defiant Sword\" can trigger ATK Effects as Basic Attack and can restore HP for Ling each time he hits an enemy.<br><br><br>This is Ling's main DMG skill, which could deal Critical Damage and trigger ATK Effect. Use it wisely and Ling could deal massive burst damage."
        },
        "ultimate": {
            "name": "Tempest of Blades",
            "icon": "https://img.mobilelegends.com/group1/M00/00/99/Cq2Ixl3CM-GANtMRAABRKV7zJsI068.png",
            "icon_local": "./hero/Ling/img/skills/ultimate_tempest_of_blades.png",
            "desc": "Ling leaps up and casts his superb sword skill for 1.5/1.5/1.5s, during which he becomes invincible and can move freely, dealing 250/350/450 Damage to enemies within the area of effect, knocking the central enemy into the air for 1/1/1s, and generating a Sword Field that lasts for 5/5/5s. At the edge of the Sword Field, there will be 4 field eyes \"Tempest of Blades\". By touching the field eye, Ling can reset the CD of \"Defiant Sword\" and restore 5 Lightness Points.",
            "tips": "Ling leaps up and casts his superb sword skill for 1.5s, during which he becomes invincible and can move freely, dealing Damage to enemies within the area of effect, knocking the central enemy into the air, and generating a Sword Field. At the edge of the Sword Field, there will be 4 field eyes “Tempest of Blades\". By touching the field eye, Ling can reset the CD of \"Defiant Sword\" and restore Lightness Points.<br><br>Choosing the right timing to activate this skill can dramatically help Ling to dodge massive DMG. Ling can get CC if he hits enemies with the core of the skill. By touching the field eye, Ling can reset \"Defiant Sword\" and restore Lightness Points and deal burst damage."
        }
    }
}