{
    "name": "Estes",
    "type": "Support",
    "story": "At the habitat of moon elves, somewhere west of the Moonlake, lies the legendary Emerald Woodland, which was the birthplace of the first generation of elves. Every elven king was born in the Tree of Life at the center of the Emerald Woodland. The elven king of the current generation is the unique Estes, who was badly hurt during the second plain war and had to go into a deep sleep in the Emerald Woodland. Moon elves lost the guidance from their king ever since that day. When the flames of wars between humans and orcs burned on this peaceful woodland, the young Moonlight Archer, Miya, stood up and gathered the rest of the elves to protect their homeland. However, the dominator of dark abyss is thirsty for more believers and the dark force has been growing stronger in secret. Seduced by the Blood Queen, Alice, some young elves have fallen. The race of moon elves was once again at stake which outraged the great elven king! During a night of great thunder and lightning, Estes woke up. He's strict but benevolent,and empowered with the strength of the sacred moonlight to protect his people and to support his allies. With the Code of Moonlight in his hands, he swore to repel every enemy who dares to violate his homeland.",
    "status": {
        "durability": "68",
        "offense": "50",
        "ability_effect": "47",
        "difficulty": "45"
    },
    "skills": {
        "passive": {
            "name": "Scripture of the Moon Elf",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cwOACJ0xAABHMw4LHMY932.png",
            "tips": "Code of Moon Elves, can charge energy and improves its basic attack dealing 450 magic damage. This basic attack will surely slow down its target. Also, it can make a splash damage dealing 225 magic damage towards nearby enemies."
        },
        "first_skill": {
            "name": "Moonlight Immersion",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cuCAfSwoAAA2kSsufGg794.png",
            "tips": "Moonlight Immersion can immediately restore one of his ally's HP. When Estes is successfully links himself to his target ally, it will heal his ally with 200 HP for 3 seconds. But, being far from the target, the link chain will be broken and the healing will stop. This skill can also heal Estes himself if needed. Estes cannot restore one ally if his HP is very low also when he lacks of mana."
        },
        "second_skill": {
            "name": "Domain of Moon God",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cuiANky3AABA1lhzNd8655.png",
            "tips": "This skill is effectively use as a trap.  Ring of trap that will slow down enemies and even monsters or creeps movements that also deals 350 magic damage to enemies within it. You can cast this right in front of you to slow enemies that attacks you. This can also be use to help your allies escape by making the enemies slow their movements. Whoever got into the ring cannot easily escape due to if they tried to run they will be slow if they touches the ring."
        },
        "ultimate": {
            "name": "Blessing of Moon Goddess",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cvCAKaGAAAA_7S77_og214.png",
            "tips": "This ultimate skill is best use as support to allies. The skill incarnates into saint king of moonlight for 8 seconds. Intensifying the effect of Moonlight Immersion. After Estes cast the Blessing of Moon Goddess, he can immediately cast The Moonlight Immersion one time for surrounding ally. When Moonlight Immersion's cooldown is done, Estes can cast again Moonlight Immersion to grant another massive restoration of one ally. For as long as the Blessing of Moon Goddess casting is still ongoing. This skill can make your allies heroes immortal in game. Also Estes will automatically heal himself a total of 1,080 HP. This is a very good regeneration buffs to allies, especially in clashing.<br>"
        }
    }
}