{
    "name": "Yi Sun-shin",
    "type": "Marksman",
    "story": "Chungmugong Yi Sun-shin was a famous general in an Asian kingdom. He was extremely loyal and brave. At a time when the nation was in danger, Yi Sun-shin built a powerful navy and created the iron armored 'turtle ship'. This made an indelible contribution to the Korean Kingdom which became known for dominating the sea areas. 'Wherever iron turtle ship sails, the sea areas belong to me.' said Yi. Yi was excellent at the strategy of 'overtaking the majority with the minority'. Under his leadership, the Korean navy defeated over 330 enemy warships with only 12 ships, gaining a great triumph at the Battle of Myeongnyang. To this day, the legend of this Asian general still lives on in the hearts of people.",
    "status": {
        "durability": "75",
        "offense": "79",
        "ability_effect": "46",
        "difficulty": "60"
    },
    "skills": {
        "passive": {
            "name": "Heavenly Vow",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7ck-ACEKtAABabVKy6iE655.png",
            "desc": "",
            "tips": "If possible always use your Glaive (Sword) to attack, the damage output from it is higher<br>Every 3 minutes a Turtleship will appear at the base, head over to collect it<br>Turtleship gives a movement speed buff and turns your “1” into a straight line skillshot that stuns the enemy when hit.<br>Has an innate slow passive, best used for chasing enemies or slowing them down when running, try to hit them as much as possible."
        },
        "first_skill": {
            "name": "One-wave Sweep",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cjWAPTxwAABRRF8RHt8478.png",
            "desc": "",
            "tips": "Your ESCAPE tool, use it wisely<br>Decent slow, for escaping or chasing<br>Turtleship would replace this skill so take note, You’ll be flying back like a normal “1” however there will be a straight line skillshot to stun the enemy."
        },
        "second_skill": {
            "name": "Blood Floods",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7ckGAJPcmAABQWLgS4sI019.png",
            "desc": "",
            "tips": "Your main harassing skill.<br>One of the hardest hitting skill<br>Range and damage increases when you charge your attack, make sure you have it charged fully for maximum damage<br>Movement while charging is possible, however it’s a little slow"
        },
        "ultimate": {
            "name": "Mountain Shocker",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7ckiAA-0yAABa0H6-Css182.png",
            "desc": "",
            "tips": "That being said, it’s not impossible to avoid this ult, try to save this when your team is engaging in a team fight or you need to know the location of your enemies.<br>Please don’t use this immediately once it’s off CD, it has one of the longest CD in the game and the mana consumption is crazy<br>When playing with friends, you can let your friend tell you when a teamfight is about to start or is happening for you to deal more residual damage. If SoloQ-ing, please keep an eye on the minimap to know when a fight is starting."
        }
    }
}