{
    "name": "Khufra",
    "type": "Tank",
    "story": "In the far reaches of the Western Desert, an ancient city lays hidden among the sands. Despite ages passing by, the desert sands were unable to devour this city, which stands proud and majestic in a sea of emptiness. Scholars of antiquities have long spoke of this fabled city, whose most infamous ruler was none other than Khufra.Khufra was a greedy ruler, colder than ice, and avaricious to limitless extents. In order to satisfy his personal desire to rule, he led the powerful army of Arnak to invade the city to conquer the Western Desert. Tirelessly, Khufra expanded his domain and riches beyond compare. Unfortunately, the Minoan Empire proved to be too difficult of a foe to conquer.  Even so, Khufra longed for more power. He sought the most famous astrologer in the Land of Dawn to help himself. Much to Khufra's dismay, the astrologer knew of Khufra's insidious goals and declined and was swiftly slain. Only the young Eslora felt deeply attracted to Khufra, who then became lovers. Khufra's callousness sent Eslora into a mess of internal conflict and love. Gradually, Eslora deeply loved Khufra and began to help Khufra with his rule. Over time, Eslora used her magical abilities to grant Khufra magical powers that were never before seen. However, Khufra became even more and more cruel and hungry for power. His conquests did not end with the Western Desert, he sought to conquer the entire Land of Dawn. Seeing the cruelty of her love, Eslora decided to save Khufra from the hate of the people.  Even then, Khufra continued to use magic to enhance his powers. He asked Eslora to give all the spells to him. He must completely eliminate the Minoan Empire. No one could question his power. One night, Eslora came to Khufra and she deeply embraced her lover. She began to place Khufra under a powerful curse, while Khufra was expecting the ultimate power given by Eslora. Suddenly, Khufra felt suppressed by a powerful force. He turned his head and looked at Eslora. No matter how Khufra tried to break free, Eslora did not stop chanting her curse. Khufra could not believe that his lover was punishing him. Eslora wept as she bound her love into an eternal slumber. She chose to personally seal her lover in the ancient city and built a grand monument. Eslora believed it was better to end Khufra before he became despised by the people, going down in history as the cruel king who loved nothing but power. Since then, the smoke of the war in the Western Desert disappeared.  However, hundreds of years later, a cataclysmic event occurred in the Western Desert. A wave of energy from an orb awakened Khufra from his slumber, who swelled with hatred and anger. Returning to the world, Khufra could not accept the betrayal of his lover in the past. His abilities and desires were stronger than ever before. He vowed to find Eslora and continue to pursue the centuries-old wish to possess the Land of Dawn within his hands.",
    "status": {
        "durability": "72",
        "offense": "66",
        "ability_effect": "78",
        "difficulty": "60"
    },
    "skills": {
        "passive": {
            "name": "Spell Curse",
            "icon": "https://img.mobilelegends.com/group1/M00/00/7D/Cq2IxlyIxmyAIqFtAABLe7UtUJM862.png",
            "desc": "Khufra activates the Spell Curse left by Esmeralda every 12s to increase the range of the Next Basic Attack, dealing Magic Damage equal to  plus 6% of his Max HP to and slowing them by 30%. Lasts 1.5s. Meanwhile, Khufra restores 8% of his Max HP. ####Each time Khufra uses his skills to control any enemy heroes, The CD of \"Spell Curse\" will be reduced by 4s.",
            "tips": "It's the only recover skill of Khufra. The enhanced basic attack grants him strong poke abilities. It's smart strategies to use the skill and trigger passive twice in a short time and restore much HP."
        },
        "first_skill": {
            "name": "Tyrant's Revenge",
            "icon": "https://img.mobilelegends.com/group1/M00/00/7D/Cq2IxlyIxk-AaNj5AABUM4Rnmec979.png",
            "desc": "Khufra pulls the bandage on his arms to launch himself in the specified direction, dealing Physical Damage equal to 80/110/140/170/200/230 plus 10/10/10/10/10/10% of his Max HP to all enemy units on the path. When blinking to the furthest distance or encountering a first enemy hero, Khufra will immediately stop, dealing Physical Damage equal to 80/110/140/170/200/230 plus 10/10/10/10/10/10% of his Max HP to enemies nearby and then knocking them in the air for up to 1.1/1.1/1.1/1.1/1.1/1.1s.",
            "tips": "It's the main skill for Khufra to join the battle. The longer he charges, the longer the knock-up effect will be. Try to better use it with ultimate \"Tyrant's Rage\" and control enemy heroes much longer."
        },
        "second_skill": {
            "name": "Bouncing Ball",
            "icon": "https://img.mobilelegends.com/group1/M00/00/7D/Cq2IxlyIxleAKtLoAABB_Ss7mqA825.png",
            "desc": "Khufra uses bandage to wrap himself into a magic bouncing ball, increasing his own Physical&Magic Defense by 60%/68%/76%/84%/92%/100%. Enemies trying to use blink skills to move across Khufra will be knocked airborne. ####Each time the magic bouncing ball hits the ground, it will deal Magic Damage equal to 30/45/60/75/90/105 plus 6/6/6/6/6/6% of his Max HP to enemies nearby and slow them by 80%/80%/80%/80%/80%/80%. Lasts 0.5/0.5/0.5/0.5/0.5/0.5s.",
            "tips": "Each time the magical bouncing ball hits the ground, it will deal Magic Damage to enemies nearby and reduce their movement speed. This skill counters the heroes that are good at blink skills - they can not move across the bouncing ball."
        },
        "ultimate": {
            "name": "Tyrant's Rage",
            "icon": "https://img.mobilelegends.com/group1/M00/00/7D/Cq2IxlyIxmKAFHBMAABJN99UOG8554.png",
            "desc": "Khufra pulls back all enemy targets around him toward his front, dealing 300/450/600 points of Physical Damage and slowing them down for 1.25/1.5/1.75s. If the enemies are knocked against walls, extra Physical Damage equal to 150%/150%/150% of this skill's damage will be inflicted upon them, and they will be stunned, instead of slowed.",
            "tips": "Needs practice to well use this skill. Better use it with 1st skill and it would be easier for Khufra to deal huge damage and control enemies for a long time."
        }
    }
}