{
    "name": "Kagura",
    "type": "Mage",
    "story": "Onmyouji Master is a master of the yin yang arts, driven by the powerful spirits, yin and yang. The Kagura family is the oldest and most powerful of the Onmyouji, with the most powerful of all being the Ancestor Master. Kagura, as one in the Onmyouji family with the most potential, was given the Seimei umbrella, an heirloom of the yin yang arts passed down through generations. Legend has it that the umbrella was refined by the great Seimei himself using power from a hundred ghosts. It is believed that it now possesses life and wisdom of its own which can only be controlled by its rightful owner. After learning that her childhood playmate Hayabusa had departed for the Land of Dawn to undertake a dangerous mission, Kagura secretly took the Seimei umbrella and followed in Hayabusa's step, hoping to help him in battle.",
    "status": {
        "durability": "92",
        "offense": "43",
        "ability_effect": "60",
        "difficulty": "88"
    },
    "skills": {
        "passive": {
            "name": "Yin Yang Gathering ",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cYeAKLLHAABni95P2mc237.png",
            "icon_local": "./hero/Kagura/img/skills/passive_yin_yang_gathering_.png",
            "desc": "",
            "tips": "One of your most important skills, this is what makes her an insane poking machine..<br>Reuniting with her umbrella would trigger the passive, which gives her a mini stun and a tiny shield.<br>There are 3 ways in reuniting with the umbrella that could trigger her passive.<br>Walking out of range from the umbrella<br>Using “2” to teleport to the umbrella<br>Walking over to the umbrella."
        },
        "first_skill": {
            "name": "Seimei Umbrella Open ",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cWqAacSQAABgEqfMxnw444.png",
            "icon_local": "./hero/Kagura/img/skills/first_skill_seimei_umbrella_open_.png",
            "desc": "",
            "tips": "It can act as an ward, throw the umbrella into a bush to reveal the location. This could reduce the chances of getting ganked.<br>There’s a built in slow whenever you hit, this CC annoys the hell out of your enemy. When escaping, keep throwing your umbrella towards your enemy to slow them down. This allows easier escape<br>To poke your enemy, it’s easier if your umbrella is out in the open, since it’s nearly unpredictable plus there’s a shorter distance to cover when compared to the umbrella flying out from you.<br>This ability allows you to poke people under their tower due to her insane range, remember point “2” under the passive section? Proc-ing the passive while under the the tower range allows you to take a hit from the tower, paired with the annoying range, it’s a pretty deadly combo."
        },
        "second_skill": {
            "name": "Rasho Umbrella Flee",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cXWAeJvVAABT-EkDLko165.png",
            "icon_local": "./hero/Kagura/img/skills/second_skill_rasho_umbrella_flee.png",
            "desc": "",
            "tips": "Your bread and butter skill. The skill that makes her so annoying to deal with, with the built in purify. It makes her pretty much immune to all CCs. The one skill that allows her to slip away from chasing enemies when mastered."
        },
        "ultimate": {
            "name": "Yin Yang Overturn",
            "icon": "https://img.mobilelegends.com/group1/M00/00/03/rB_-LVo7cX-AZLwlAABcv5Qi8gc242.png",
            "icon_local": "./hero/Kagura/img/skills/ultimate_yin_yang_overturn.png",
            "desc": "",
            "tips": "Use this skill with your “2” after teleporting to your umbrella proc “3” to deal some damage to the enemy and knocking them back.<br>This skill can be use to intercept enemies that are chasing your allies, the knockback and slow gives your allies some time to escape<br>You can even proc “3” before you dash away to escape<br>Teleporting behind your enemies and proc-ing “3” when they are near your tower can knock them towards your tower."
        }
    }
}